Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་། ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to mental consciousness [and so forth] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མིག་གི་འདུས་ཏེ་རེག་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to visually compounded sensory contact as being impermanent.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to visually compounded sensory contact as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact as being impermanent.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་། ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to mentally compounded sensory contact [and so forth] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to feelings conditioned by visually compounded sensory contact as being impermanent.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to feelings conditioned by visually compounded sensory contact as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact as being impermanent.

source: །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་། དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to feelings conditioned by mentally compounded sensory contact [and so forth] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སའི་ཁམས་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to the earth element as being impermanent.

source: །སའི་ཁམས་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to the earth element as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to the water element, the fire element, the wind element, the space element, and the consciousness element as being impermanent.

source: །རྣམ་པར་ཤེས་པའི་ཁམས་ནི་སྡུག་བསྔལ་བ་དང་།
en: They should direct their attention to the consciousness element [and so forth] as being suffering, without self, {Ki.

source: བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་། ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: II-III: 3} at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to ignorance as being impermanent.

source: མ་རིག་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ་མ་རིག་པ་ནི་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to ignorance as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death as being impermanent.

source: །རྒ་ཤི་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to aging and death [and so forth] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། མ་རིག་པ་འགག་པ་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་འགག་པ་ནི་བདག་མེད་པར་ཡིད་ལ་བྱའོ།
en: Similarly, without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to the cessation of ignorance and the cessations of formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, aging, death, sorrow, lamentation, pain, discomfort, and disturbance as being without self.

source: །དེ་བཞིན་དུ་ཞི་བ་དང་དབེན་པ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་འདུ་བྱ་བ་མེད་པར་ཡིད་ལ་བྱའོ།
en: Similarly, they should direct their attention to these being at peace, void, vacuous, signless, wishless, and unconditioned. {Ki.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: II-III: 4} “Moreover, Kauśika, without apprehending anything, those bodhisattva great beings who set their mind on the enlightenment of all-aspect omniscience practice the perfection of generosity.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྒོམ་མོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: Moreover, Kauśika, without apprehending anything, those bodhisattva great beings who set their mind on the enlightenment of all-aspect omniscience cultivate the four applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་སྟོབས་ལྡན་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་བསྒོམ་མོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་ཀྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience cultivate the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒོམ་མོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience cultivate the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡང་དག་པར་སློབ་སྟེ། ཆོས་རྣམས་མངོན་པར་རླན་པར་བྱེད་པ་དང་། ཡོངས་སུ་རླན་པར་བྱེད་པ་དང་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་ཡོངས་སུ་རྒྱས་པར་བྱེད་པ་དང་ཡོངས་སུ་དཔྱོད་པར་བྱེད་པ་དེ་དག་ནི་ཆོས་ཁོ་ནར་ཟད་དེ།
en: Moreover, Kauśika, when bodhisattva great beings practice the perfection of wisdom, they train as follows: They soften, mollify, perfect, augment, and contemplate phenomena simply in accordance with the Dharma. [

source: དེ་ལ་བདག་གམ་བདག་གི་མེད་དོ།
en: They discern that] the concepts of ‘I’ and ‘mine’ are nonexistent.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་བསྔོ་བའི་སེམས་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་དང་འགྲོགས་པ་མ་ཡིན།
en: If you ask why, it is because thoughts of dedication, possessed by bodhisattva great beings, are not associated with the mind of enlightenment.

source: བྱང་ཆུབ་ཀྱི་སེམས་གང་ཡིན་པ་དེ་ཡང་ཡོངས་སུ་བསྔོ་བའི་སེམས་དང་འགྲོགས་པ་མ་ཡིན་ཏེ།
en: The mind of enlightenment is not associated with thoughts of dedication.

source: ཀཽ་ཤི་ཀ་ཡོངས་སུ་བསྔོ་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མེད་ཅིང་མི་དམིགས།
en: Kauśika, thoughts of dedication are nonexistent and nonapprehensible in the mind of enlightenment.

source: བྱང་ཆུབ་ཀྱི་སེམས་གང་ཡིན་པ་དེ་ནི་ཡོངས་སུ་བསྔོ་བའི་སེམས་ལ་མེད་ཅིང་མི་དམིགས་ཏེ།
en: The mind of enlightenment is nonexistent and nonapprehensible in thoughts of dedication.

source: ཀཽ་ཤི་ཀ་གང་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཡང་རབ་ཏུ་རྟོག་ལ།
en: Indeed Kauśika, all attributes should be correctly discerned in that manner.

source: ཆོས་གང་ལ་ཡང་རྣམ་པར་རྒྱུ་བ་མེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: That which does not move toward anything is the perfection of wisdom of bodhisattva great beings.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་ཡོངས་སུ་བསྔོ་བའི་སེམས་བྱང་ཆུབ་ཀྱི་སེམས་དང་འགྲོགས་པ་མ་ཡིན།
en: Then Śakra, mighty lord of the gods, inquired of the venerable Subhūti, “Blessed Subhūti, in what way are thoughts of dedication not associated with the mind of enlightenment?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བསྔོ་བའི་སེམས་དང་འགྲོགས་པ་མ་ཡིན།
en: In what way is the mind of enlightenment not associated with thoughts of dedication?

source: ཇི་ལྟར་ན་ཡོངས་སུ་བསྔོ་བའི་སེམས་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མེད་ཅིང་མི་དམིགས།
en: In what way are thoughts of dedication nonexistent and nonapprehensible in the mind of enlightenment?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བསྔོ་བའི་སེམས་ལ་མེད་ཅིང་མི་དམིགས་རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: In what way is the mind of enlightenment nonexistent and nonapprehensible in thoughts of dedication?” “

source: ཀཽ་ཤི་ཀ་ཡོངས་སུ་བསྔོ་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་སེམས་མ་ཡིན།
en: Kauśika,” replied Subhūti, “thoughts of dedication are not thought.

source: བྱང་ཆུབ་ཀྱི་སེམས་གང་ཡིན་པ་དེ་ཡང་སེམས་མ་ཡིན་ཏེ།
en: The mind of enlightenment is not thought.

source: དེ་ལྟར་ན་སེམས་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ། །བསམ་གྱིས་མི་ཁྱབ་པ་གང་ཡིན་པ་དེ་ནི་སེམས་མ་ཡིན་པ་སྟེ།
en: Thus, that which is not thought is inconceivable, and that which is inconceivable is not thought.

source: སེམས་མ་ཡིན་པ་དེ་ནི་སེམས་མ་ཡིན་པར་ཡང་ཡོངས་སུ་བསྔོ་བ་མེད།
en: That which is not thought does not dedicate merits to that which is not thought.

source: བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པར་ཡོངས་སུ་བསྔོ་བ་མེད་དེ།
en: Nor does inconceivability dedicate merits to the inconceivable.

source: དེ་ལྟར་ན་སེམས་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Thus, that which is not mind is inconceivable.

source: །བསམ་གྱིས་མི་ཁྱབ་པ་གང་ཡིན་པ་དེ་ནི་སེམས་མ་ཡིན་པ་སྟེ།
en: That which is inconceivable is not mind.

source: གང་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཡང་སོ་སོར་རྟོག་ལ། ཆོས་གང་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་ཅིང་མི་དམིགས་པ་འདི་ནི།
en: That which discerns all phenomena accordingly is not fixated on anything at all, nor does it apprehend anything.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This, Kauśika, is the bodhisattva great beings’ perfection of wisdom.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་བ།
en: Then the Blessed One said to the venerable Subhūti, “Excellent!

source: རབ་འབྱོར་ཁྱོད་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་ཅིང་མོས་པ་སྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: It is excellent {Ki.II-III: 5} that in that way, Subhūti, you are teaching the perfection of wisdom to bodhisattva great beings and you are energizing them.

source: །རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Excellent, Subhūti, that is excellent!” “

source: །རབ་འབྱོར་གྱིས་གསོལ་བ། བཅོམ་ལྡན་འདས་བདག་གིས་ནི་བཀའ་དྲིན་དྲན་པར་བགྱིས་ཏེ། བཀའ་དྲིན་མི་དྲན་པར་མི་བགྱིའོ།
en: Blessed Lord, I should feel gratitude, and I should not fail to feel gratitude,” replied Subhūti. “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བཞུགས་པའི་ཚེ། དེ་དག་གི་ཉན་ཐོས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་བའི་ཚེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པར་བགྱིས་ཏེ།
en: If one were to ask why, it is because when the tathāgatas, arhats, completely awakened buddhas of the past were alive, and formerly while the Tathāgata, Arhat, completely awakened Buddha was still a bodhisattva, their śrāvakas taught and instructed him in the six perfections.

source: དགྱེས་པ་དང་ཡང་དག་པར་བསྐུལ་བ་དང་ལེགས་པར་གཟེང་བསྟོད་པ་དང་། རབ་ཏུ་དགྱེས་པ་དང་གཞག་པ་དང་།
en: They caused him to delight in them, and they encouraged, induced, aroused, established, and absolutely secured him in them.

source: ཤིན་དུ་བརྟན་པར་བགྱིས་པས། སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་ཚེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་བསླབ་པ་མཛད་དེ། བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Consequently, the Blessed Lord, formerly while he was still a bodhisattva, trained in the six perfections, and subsequently attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གདམས་པར་བགྱིའོ། །རྗེས་སུ་བསྟན་པར་བགྱིའོ། །དགའ་བར་བགྱིའོ། ཡང་དག་པར་བསྐུལ་བར་བགྱིའོ། ལེགས་པར་གཟེང་བསྟོད་པར་བགྱིའོ།
en: Blessed Lord, in that same way we too should teach and instruct bodhisattva great beings in the six perfections.

source: །རབ་ཏུ་དགའ་བར་བགྱིའོ།
en: We should cause them to delight in them.

source: །དགོད་པར་བགྱིའོ། །ཤིན་དུ་བརྟན་པར་བགྱིའོ།
en: We should encourage them, induce them, arouse them, establish them, and absolutely secure them in them!

source: །བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་དེ་ལྟར་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པ་དང་དགའ་བར་བགྱིས་པ་དང་། ཡང་དག་པར་བསྐུལ་བ་དང་ལེགས་པར་གཟེང་བསྟོད་པ་དང་རབ་ཏུ་དགའ་བར་བགྱིས་པ་དང་བཀོད་པ་དང་ཤིན་དུ་བརྟན་པ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Those bodhisattva great beings whom we have taught, instructed, caused to delight in, encouraged, induced, aroused, established, and absolutely secured in the six perfections in that manner will also subsequently attain consummate buddhahood in unsurpassed, complete enlightenment.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་དེའི་ཕྱིར་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: The venerable Subhūti then said to Śakra, mighty lord of the gods, “For that reason, Kauśika, you should listen carefully and keep this in mind!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བྱ་བ་དང་། ཇི་ལྟར་མི་གནས་པར་བྱ་བ་བདག་གིས་བཤད་དོ།
en: I will explain how bodhisattva great beings should dwell and how they should not dwell in the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Kauśika, physical forms are empty of physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and the aforementioned aggregates].

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་།
en: The bodhisattvas are empty of the bodhisattvas.

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་གཟུགས་སྟོང་པ་ཉིད་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of physical forms and the emptiness of feelings, perceptions, formative predispositions, and consciousness on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two.

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་གནས་པར་བྱའོ།
en: Kauśika, bodhisattva great beings should dwell accordingly in the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་མིག་ནི་མིག་གིས་སྟོང་ངོ་། །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ནི་ཡིད་ཀྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, the eyes are empty of the eyes, and the ears, nose, tongue, body, and mental faculty are empty of the mental faculty [and those other sense organs].

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་མིག་སྟོང་པ་ཉིད་དང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Thus, Kauśika, the emptiness of the eyes and the emptiness of the ears, nose, tongue, body, and mental faculty on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two. “

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ནི་ཆོས་ཀྱིས་སྟོང་ངོ་།
en: Moreover, Kauśika, sights are empty of sights, and sounds, odors, tastes, tangibles, and mental phenomena are empty of mental phenomena [and those other sense objects].

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་གཟུགས་སྟོང་པ་ཉིད་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་སྟོང་པ་ཉིད་དང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: Thus, Kauśika, the emptiness of sights and the emptiness of sounds, odors, tastes, tangibles, and mental phenomena on the one hand, and this emptiness of the bodhisattvas on the other, are not two things, and are not to be divided into two. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་མིག་གི་རྣམ་པར་ཤེས་པ་ནི་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Moreover, Kauśika, visual consciousness is empty of visual consciousness, and auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are empty of mental consciousness [and those other aspects of consciousness].
